# Ann Arbor Load Profiles Construction

To-Do: 
- Load 2018 & 2019 DTE load profiles, which live in raw_csv and are broken down by class
- Map rate names to customer class (Res & Com)
- Group together all the residential rates into one hourly profile
- Do the same with commercial rates
- Obtain 2018 & 2019 EIA MI sales by utility and extract Res & Com customer counts from DTE (both Bundled & Delivery)
- Obtain 2019 & 2019 ACS Ann Arbor counts of Res units & Com establishments
- scale DTE Res & Com load profiles down by the ratio of ACS/EIA counts for their respective types
- Upload resulting load profile & plot to Teams

In [1]:
import pandas as pd
import matplotlib.pyplot as plt
from datetime import datetime

In [4]:
# customer counts from DTE & A2
    # DTE numbers from eia-861 (raw_xlsx)
    # A2 numbers are currently a guess; waiting on ACS numbers from Eli
dteResCount2018 = 1992276 + 35 # bundled + delivery
dteComCount2018 = 203576 + 4418 
dteResCount2019 = 2003620 + 33
dteComCount2019 = 204660 + 4341

a2ResCount2018 = 121701 // 3 
a2ComCount2018 = 15000
a2ResCount2019 = 120111 // 3
a2ComCount2019 = 14950

In [8]:
dfDte2018 = pd.read_csv('raw_csv/dte-2018-by-class.csv')
dfDte2018

               Class Rate  Month  Day  Hour     2018 kWh
0        Residential   D1      1    1     1   1,997,548
1        Residential   D1      1    1     2   1,876,672
2        Residential   D1      1    1     3   1,765,548
3        Residential   D1      1    1     4   1,708,013
4        Residential   D1      1    1     5   1,678,923
...              ...  ...    ...  ...   ...          ...
486911  RA-Secondary   R8     12   31    20         231
486912  RA-Secondary   R8     12   31    21         211
486913  RA-Secondary   R8     12   31    22         203
486914  RA-Secondary   R8     12   31    23         205
486915  RA-Secondary   R8     12   31    24         204

[486916 rows x 6 columns]